In [1]:
import pandas as pd
import numpy as np


dates = pd.date_range("20250101", periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2025-01-01 -0.199917  0.939084 -1.382578  2.167672
2025-01-02  1.221864 -0.349532 -0.820270  1.260893
2025-01-03 -0.229235 -2.120888 -0.879803  0.996748
2025-01-04  0.728152  0.575226 -0.192768 -0.698873
2025-01-05  1.210111 -0.980317 -1.321737 -0.575919
2025-01-06 -0.964699 -0.642485 -2.426201 -1.083127

In [2]:
df1 = df.reindex(index=dates[0: 4], columns=list(df.columns) + ['E'])
df1.iloc[0:2,4] = 1
df1

                   A         B         C         D    E
2025-01-01 -0.199917  0.939084 -1.382578  2.167672  1.0
2025-01-02  1.221864 -0.349532 -0.820270  1.260893  1.0
2025-01-03 -0.229235 -2.120888 -0.879803  0.996748  NaN
2025-01-04  0.728152  0.575226 -0.192768 -0.698873  NaN

In [3]:
df1.dropna()

                   A         B         C         D    E
2025-01-01 -0.199917  0.939084 -1.382578  2.167672  1.0
2025-01-02  1.221864 -0.349532 -0.820270  1.260893  1.0

In [4]:
df1.fillna(5)

                   A         B         C         D    E
2025-01-01 -0.199917  0.939084 -1.382578  2.167672  1.0
2025-01-02  1.221864 -0.349532 -0.820270  1.260893  1.0
2025-01-03 -0.229235 -2.120888 -0.879803  0.996748  5.0
2025-01-04  0.728152  0.575226 -0.192768 -0.698873  5.0

In [5]:
s = pd.Series([1, 3, 1, np.nan, 6, 8], index=dates).shift(2)
s

2025-01-01    NaN
2025-01-02    NaN
2025-01-03    1.0
2025-01-04    3.0
2025-01-05    1.0
2025-01-06    NaN
Freq: D, dtype: float64

In [6]:
df

                   A         B         C         D
2025-01-01 -0.199917  0.939084 -1.382578  2.167672
2025-01-02  1.221864 -0.349532 -0.820270  1.260893
2025-01-03 -0.229235 -2.120888 -0.879803  0.996748
2025-01-04  0.728152  0.575226 -0.192768 -0.698873
2025-01-05  1.210111 -0.980317 -1.321737 -0.575919
2025-01-06 -0.964699 -0.642485 -2.426201 -1.083127

In [7]:
df.sub(s, axis="index")

                   A         B         C         D
2025-01-01       NaN       NaN       NaN       NaN
2025-01-02       NaN       NaN       NaN       NaN
2025-01-03 -1.229235 -3.120888 -1.879803 -0.003252
2025-01-04 -2.271848 -2.424774 -3.192768 -3.698873
2025-01-05  0.210111 -1.980317 -2.321737 -1.575919
2025-01-06       NaN       NaN       NaN       NaN

In [8]:
df

                   A         B         C         D
2025-01-01 -0.199917  0.939084 -1.382578  2.167672
2025-01-02  1.221864 -0.349532 -0.820270  1.260893
2025-01-03 -0.229235 -2.120888 -0.879803  0.996748
2025-01-04  0.728152  0.575226 -0.192768 -0.698873
2025-01-05  1.210111 -0.980317 -1.321737 -0.575919
2025-01-06 -0.964699 -0.642485 -2.426201 -1.083127

In [9]:
df.A.transform(lambda x: x*100)

2025-01-01    -19.991727
2025-01-02    122.186449
2025-01-03    -22.923461
2025-01-04     72.815214
2025-01-05    121.011053
2025-01-06    -96.469944
Freq: D, Name: A, dtype: float64

In [10]:
df.agg(lambda x: np.mean(x) * 100)

A     29.437930
B    -42.981862
C   -117.055963
D     34.456569
dtype: float64

In [11]:
pd.concat([df, df]).value_counts()

A          B          C          D
-0.964699  -0.642485  -2.426201  -1.083127    2
-0.229235  -2.120888  -0.879803   0.996748    2
-0.199917   0.939084  -1.382578   2.167672    2
 0.728152   0.575226  -0.192768  -0.698873    2
 1.210111  -0.980317  -1.321737  -0.575919    2
 1.221864  -0.349532  -0.820270   1.260893    2
Name: count, dtype: int64

In [12]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [13]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [14]:
df1 = df.copy(deep=True)
df1.columns = df.columns.str.lower()
df1

                   a         b         c         d
2025-01-01 -0.199917  0.939084 -1.382578  2.167672
2025-01-02  1.221864 -0.349532 -0.820270  1.260893
2025-01-03 -0.229235 -2.120888 -0.879803  0.996748
2025-01-04  0.728152  0.575226 -0.192768 -0.698873
2025-01-05  1.210111 -0.980317 -1.321737 -0.575919
2025-01-06 -0.964699 -0.642485 -2.426201 -1.083127

In [15]:
df.join(df1)

,A,B,C,D,a,b,c,d
2025-01-01,-0.199917,0.939084,-1.382578,2.167672,-0.199917,0.939084,-1.382578,2.167672
2025-01-02,1.221864,-0.349532,-0.820270,1.260893,1.221864,-0.349532,-0.820270,1.260893
2025-01-03,-0.229235,-2.120888,-0.879803,0.996748,-0.229235,-2.120888,-0.879803,0.996748
2025-01-04,0.728152,0.575226,-0.192768,-0.698873,0.728152,0.575226,-0.192768,-0.698873
2025-01-05,1.210111,-0.980317,-1.321737,-0.575919,1.210111,-0.980317,-1.321737,-0.575919
2025-01-06,-0.964699,-0.642485,-2.426201,-1.083127,-0.964699,-0.642485,-2.426201,-1.083127

In [16]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})

left.merge(right, on='key', how='inner')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [17]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],"k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [18]:
data[~data.k1.duplicated()]

    k1  k2
0  one   1
1  two   1

In [19]:
data.drop_duplicates('k1', keep='last')

    k1  k2
4  one   3
6  two   4

In [20]:
class Solution:
    def maxSubArray(self, nums: list[int]) -> int:
        res = float('-inf')
        curr = 0
        for n in nums:
            curr = max(0, curr+n)
            curr += n
            res = max(curr, res)
        
        return res

In [21]:
s = pd.Series(['a', 'b', 'c', 'd'] * 2)
cat_s = s.astype('category')
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [22]:
cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [23]:
data = pd.Series(np.random.uniform(size=9), index=[["a", "a", "a", "b", "b", "c", "c", "d", "d"],  [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    0.311733
   2    0.874792
   3    0.561467
b  1    0.390074
   3    0.308630
c  1    0.508631
   2    0.959376
d  2    0.332418
   3    0.982274
dtype: float64

In [24]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [25]:
data.b

1    0.390074
3    0.308630
dtype: float64

In [26]:
data

a  1    0.311733
   2    0.874792
   3    0.561467
b  1    0.390074
   3    0.308630
c  1    0.508631
   2    0.959376
d  2    0.332418
   3    0.982274
dtype: float64

In [27]:
data.unstack()

          1         2         3
a  0.311733  0.874792  0.561467
b  0.390074       NaN  0.308630
c  0.508631  0.959376       NaN
d       NaN  0.332418  0.982274

In [28]:
df1 = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"], "data1": pd.Series(range(6), dtype="Int64")})

df2 = pd.DataFrame({"key": ["a", "b", "a", "b", "d"], "data2": pd.Series(range(5), dtype="Int64")})

df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [29]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [30]:
df1.merge(df2)

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   a      2      0
5   a      2      2
6   a      4      0
7   a      4      2
8   b      5      1
9   b      5      3

In [31]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   a      2      0
5   a      2      2
6   a      4      0
7   a      4      2
8   b      5      1
9   b      5      3

In [32]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [33]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [34]:
df1.set_index('key').join(df2.set_index('key'))

     data1  data2
key
b        0      1
b        0      3
b        1      1
b        1      3
a        2      0
a        2      2
c        3   <NA>
a        4      0
a        4      2
b        5      1
b        5      3

In [1]:
class Solution:
    def threeSum(self, nums: list[int]) -> list[list[int]]:
        nums.sort()
        print(nums)
        res = []
        n = len(nums)
        for i, num in enumerate(nums):
            l, r = i+1, n-1
            while l < r:
                curr_sum = num+nums[l]+nums[r]
                if curr_sum==0:
                    res.append([num, nums[l], nums[r]])
                    l += 1
                    r -= 1
                elif curr_sum < 0:
                    l += 1
                else:
                    r -= 1
        return res

Solution().threeSum([-1,0,1,2,-1,-4])

[-4, -1, -1, 0, 1, 2]

[[-1, -1, 2], [-1, 0, 1], [-1, 0, 1]]